export const JIJANGAN: Record<string, { stems: string[], ratios: number[] }> = {
  子: { stems: ['壬', '癸'], ratios: [0.3, 0.7] },
  丑: { stems: ['癸', '辛', '己'], ratios: [0.1, 0.2, 0.7] },
  寅: { stems: ['戊', '丙', '甲'], ratios: [0.2, 0.3, 0.5] },
  卯: { stems: ['甲', '乙'], ratios: [0.3, 0.7] },
  辰: { stems: ['乙', '癸', '戊'], ratios: [0.3, 0.1, 0.6] },
  巳: { stems: ['庚', '戊', '丙'], ratios: [0.2, 0.1, 0.7] },
  午: { stems: ['丙', '己', '丁'], ratios: [0.3, 0.1, 0.6] },
  未: { stems: ['丁', '乙', '己'], ratios: [0.3, 0.1, 0.6] },
  申: { stems: ['戊', '壬', '庚'], ratios: [0.2, 0.2, 0.6] },
  酉: { stems: ['庚', '辛'], ratios: [0.3, 0.7] },
  戌: { stems: ['辛', '丁', '戊'], ratios: [0.1, 0.3, 0.6] },
  亥: { stems: ['戊', '甲', '壬'], ratios: [0.1, 0.2, 0.7] },
};

export const RELATIONSHIPS = {
  HYEONG: {
    SAM_HYEONG: [['寅', '巳', '申'], ['丑', '戌', '未']],
    JA_MYO: ['子', '卯'],
    SELF_HYEONG: ['辰', '午', '酉', '亥']
  },
  HAE: { '子': '未', '丑': '午', '寅': '巳', '卯': '辰', '申': '亥', '酉': '戌' },
  PA: { '子': '酉', '丑': '辰', '寅': '亥', '卯': '午', '巳': '申', '未': '戌' },
  CHUNG: { '子': '午', '丑': '未', '寅': '申', '卯': '酉', '辰': '戌', '巳': '亥' },
  HAP: { '子': '丑', '寅': '亥', '卯': '戌', '辰': '酉', '巳': '申', '午': '未' }
};
